## 🏗️ Terraform Plan - dev

```terraform
aws_acm_certificate.cert[0]: Refreshing state... [id=arn:aws:acm:us-east-1:973030239074:certificate/1380081d-e070-42b1-bbb8-6cf963e50260]
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
aws_cloudfront_origin_access_identity.nextjs_build[0]: Refreshing state... [id=E1LT4GH56T8HYK]
aws_cloudfront_function.dir_index: Refreshing state... [id=databro-dir-index-dev]
data.aws_region.current: Read complete after 0s [id=us-east-2]
aws_cloudfront_response_headers_policy.security_headers: Refreshing state... [id=cbff1b95-c4a5-4323-bb50-dd18319c8e65]
data.aws_caller_identity.current: Read complete after 0s [id=973030239074]
aws_s3_bucket.logs[0]: Refreshing state... [id=databro-dev-build-logs-973030239074]
aws_s3_bucket.nextjs_build: Refreshing state... [id=databro-dev-build-973030239074]
aws_acm_certificate_validation.cert[0]: Refreshing state... [id=2026-01-24 22:28:32.974 +0000 UTC]
aws_s3_bucket_public_access_block.logs[0]: Refreshing state... [id=databro-dev-build-logs-973030239074]
aws_s3_bucket_server_side_encryption_configuration.logs[0]: Refreshing state... [id=databro-dev-build-logs-973030239074]
aws_s3_bucket_lifecycle_configuration.logs[0]: Refreshing state... [id=databro-dev-build-logs-973030239074]
aws_s3_bucket_public_access_block.nextjs_build: Refreshing state... [id=databro-dev-build-973030239074]
aws_s3_bucket_server_side_encryption_configuration.nextjs_build: Refreshing state... [id=databro-dev-build-973030239074]
aws_s3_bucket_policy.nextjs_build[0]: Refreshing state... [id=databro-dev-build-973030239074]
aws_s3_bucket_logging.nextjs_build[0]: Refreshing state... [id=databro-dev-build-973030239074,973030239074]
aws_s3_bucket_cors_configuration.nextjs_build: Refreshing state... [id=databro-dev-build-973030239074]
aws_s3_bucket_versioning.nextjs_build: Refreshing state... [id=databro-dev-build-973030239074]
aws_cloudfront_distribution.nextjs_build[0]: Refreshing state... [id=E2LGMLKCRB7313]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.cert[0] must be replaced
+/- resource "aws_acm_certificate" "cert" {
      ~ arn                       = "arn:aws:acm:us-east-1:973030239074:certificate/1380081d-e070-42b1-bbb8-6cf963e50260" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "dev.databro.dev"
              - resource_record_name  = "_b73e1d46d2c918a852910b8f501da4ea.dev.databro.dev."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_4e7db58f41a6a6eab644ae2d50736d9c.jkddzztszm.acm-validations.aws."
            },
          + {
              + domain_name           = "dev.data-bro.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "dev.databro.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:973030239074:certificate/1380081d-e070-42b1-bbb8-6cf963e50260" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2027-02-22T23:59:59Z" -> (known after apply)
      ~ not_before                = "2026-01-24T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "dev.data-bro.com",
            # (1 unchanged element hidden)
        ]
        tags                      = {
            "Environment" = "development"
            "Owner"       = "Kumar Saraboji"
            "Service"     = "Portfolio"
            "Track"       = "Data Engineering"
        }
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ options (known after apply)
      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
          - export                                      = "DISABLED" -> null
        }
    }

  # aws_acm_certificate_validation.cert[0] must be replaced
-/+ resource "aws_acm_certificate_validation" "cert" {
      ~ certificate_arn = "arn:aws:acm:us-east-1:973030239074:certificate/1380081d-e070-42b1-bbb8-6cf963e50260" -> (known after apply) # forces replacement
      ~ id              = "2026-01-24 22:28:32.974 +0000 UTC" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_cloudfront_distribution.nextjs_build[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "nextjs_build" {
      ~ aliases                         = [
          + "dev.data-bro.com",
            # (1 unchanged element hidden)
        ]
        id                              = "E2LGMLKCRB7313"
        tags                            = {
            "Environment" = "dev"
            "Name"        = "databro-cloudfront-dev"
            "Owner"       = "Kumar Saraboji"
            "Service"     = "Portfolio"
            "Track"       = "Data Engineering"
        }
        # (24 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:973030239074:certificate/1380081d-e070-42b1-bbb8-6cf963e50260" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ acm_certificate_validation_options = [
      ~ {
          ~ domain_name           = "dev.databro.dev" -> "dev.data-bro.com"
          ~ resource_record_name  = "_b73e1d46d2c918a852910b8f501da4ea.dev.databro.dev." -> (known after apply)
          ~ resource_record_type  = "CNAME" -> (known after apply)
          ~ resource_record_value = "_4e7db58f41a6a6eab644ae2d50736d9c.jkddzztszm.acm-validations.aws." -> (known after apply)
        },
      + {
          + domain_name           = "dev.databro.dev"
          + resource_record_name  = (known after apply)
          + resource_record_type  = (known after apply)
          + resource_record_value = (known after apply)
        },
    ]

Warning: Argument is deprecated

  with aws_s3_bucket_logging.nextjs_build[0],
  on s3.tf line 92, in resource "aws_s3_bucket_logging" "nextjs_build":
  92:   expected_bucket_owner = data.aws_caller_identity.current.account_id

expected_bucket_owner is deprecated. It will be removed in a future verion of
the provider.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

**Plan Status**: success
**Validation**: success
**Format**: failure